import React from "react";

function Book() {
  const reviews = [
    "Дуже пізнавальна книга.",
    "Чудове пояснення складних для розуміння процесів.",
    "Добре підібраний матеріал для самостійного вивчення."
  ];

  return (
    <div style={{ padding: "20px", fontFamily: "Arial" }}>
      <h1>Моя улюблена книга</h1>
      <h2>Назва: Цікава Фізика. Книга 1</h2>
      <p><b>Автор:</b> Перельман Яків Ісидорович</p>
      <p><b>Жанр:</b> наукова література</p>
      <p><b>Кількість сторінок:</b> 133</p>
      <h3>Рецензії:</h3>
      <ul>
        {reviews.map((r, i) => (
          <li key={i}>{r}</li>
        ))}
      </ul>
    </div>
  );
}

export default Book;